#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрограммаПриИзменении(Элемент)

	ДанныеДляЗаполнения = ПолучитьДанныеРуководителяНаСервере(Объект.Программа);

	Объект.Руководитель = ДанныеДляЗаполнения.Руководитель;
	Объект.ДолжностьРуководителя = ДанныеДляЗаполнения.Должность;
	Объект.СтепеньРуководителя = ДанныеДляЗаполнения.Степень;
	Объект.КафедраРуководителя = ДанныеДляЗаполнения.Кафедра;
	Объект.РазмерОкладаРуководителя = ДанныеДляЗаполнения.РазмерОклада;
	Объект.ОбъемПрограммы = ДанныеДляЗаполнения.КоличествоУчебныхЧасов;
	Объект.КоличествоСтудентов = ДанныеДляЗаполнения.КоличествоСлушателей;

	НормаЧасовРуководителя = 850;
	КоэффициентРасчета = 10;
	ПроцентОплаты = 100;
	ПроцентПремии = 0.2;
	МаксимальнаяВыплатаРуководителю = 30000;

	Объект.НормаЧасовРуководителя = НормаЧасовРуководителя;
	Объект.ТарифРуководителя = (ДанныеДляЗаполнения.РазмерОклада / НормаЧасовРуководителя) * КоэффициентРасчета;
	КВыплате = (Объект.ТарифРуководителя * Объект.КоличествоСтудентов * Объект.ОбъемПрограммы)
		/ ПроцентОплаты * ПроцентПремии;
	Объект.КВыплатеРуководителю = ?(КВыплате > МаксимальнаяВыплатаРуководителю, МаксимальнаяВыплатаРуководителю, КВыплате);

КонецПроцедуры

&НаКлиенте
Процедура НормаЧасовРуководителяПриИзменении(Элемент)

	Если Объект.НормаЧасовРуководителя = 0 Тогда
		Возврат;
	КонецЕсли;

	КоэффициентРасчета = 10;
	ПроцентОплаты = 100;
	ПроцентПремии = 0.2;
	МаксимальнаяВыплатаРуководителю = 30000;

	Объект.ТарифРуководителя = (Объект.РазмерОкладаРуководителя / Объект.НормаЧасовРуководителя) * КоэффициентРасчета;
	КВыплате = (Объект.ТарифРуководителя * Объект.КоличествоСтудентов * Объект.ОбъемПрограммы)
		/ ПроцентОплаты * ПроцентПремии;
	Объект.КВыплатеРуководителю = ?(КВыплате > МаксимальнаяВыплатаРуководителю, МаксимальнаяВыплатаРуководителю, КВыплате);

КонецПроцедуры

&НаКлиенте
Процедура Согласовано1ПриИзменении(Элемент)

	Объект.Согласовано1Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано1);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано2ПриИзменении(Элемент)
	
	Объект.Согласовано2Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано2);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано3ПриИзменении(Элемент)                                              
	
	Объект.Согласовано3Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано3);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеРуководителяНаСервере(Знач Ссылка)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	УчебныеПрограммы.РуководительПрограммы КАК РуководительПрограммы,
	               |	Сотрудники.Должность КАК Должность,
	               |	Сотрудники.Степень КАК Степень,
	               |	Сотрудники.Подразделение КАК Подразделение,
	               |	ДолжностныеОклады.РазмерОклада КАК РазмерОклада,
	               |	УчебныеПрограммы.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
	               |	УчебныеПрограммы.КоличествоСлушателей КАК КоличествоСлушателей
	               |ИЗ
	               |	Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеОклады КАК ДолжностныеОклады
	               |			ПО Сотрудники.Должность = ДолжностныеОклады.Должность
	               |				И Сотрудники.Степень = ДолжностныеОклады.УченаяСтепень
	               |		ПО УчебныеПрограммы.РуководительПрограммы = Сотрудники.Ссылка
	               |ГДЕ
	               |	УчебныеПрограммы.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Выборка.РуководительПрограммы);
		ДанныеДляЗаполнения.Вставить("Должность", Выборка.Должность);
		ДанныеДляЗаполнения.Вставить("Степень", Выборка.Степень);
		ДанныеДляЗаполнения.Вставить("Кафедра", Выборка.Подразделение);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", Выборка.РазмерОклада);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", Выборка.КоличествоУчебныхЧасов);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", Выборка.КоличествоСлушателей);
	Иначе
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Неопределено);
		ДанныеДляЗаполнения.Вставить("Должность", Неопределено);
		ДанныеДляЗаполнения.Вставить("Степень", Неопределено);
		ДанныеДляЗаполнения.Вставить("Кафедра", Неопределено);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", 0);
	КонецЕсли;

	Возврат ДанныеДляЗаполнения;

КонецФункции

&НаСервере
Функция ПолучитьШаблонДолжностиНаСервере(Согласовано)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", Согласовано);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ДолжностьШаблон КАК ДолжностьШаблон
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДолжностьШаблон;  
    КонецЕсли;

КонецФункции

#КонецОбласти

