#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Корректировка;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Преподаватель", "Преподаватель");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Месяц", "Месяц");
	Блокировка.Заблокировать();
	
	Движения.НагрузкаПреподавателей.Записывать = Истина;
	
	Для Каждого СтрокаКорректировки Из Корректировка Цикл
		
		Если СтрокаКорректировки.КоличествоЧасов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКорректировки.Преподаватель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен преподаватель в строке " + СтрокаКорректировки.НомерСтроки;
			СообщениеПользователю.Поле = "Корректировка[" + СтрокаКорректировки.НомерСтроки + "].Преподаватель";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКорректировки.Месяц) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен месяц в строке " + СтрокаКорректировки.НомерСтроки;
			СообщениеПользователю.Поле = "Корректировка[" + СтрокаКорректировки.НомерСтроки + "].Месяц";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.НагрузкаПреподавателей.Добавить();	
		Движение.Период = Дата;
		Движение.Преподаватель = СтрокаКорректировки.Преподаватель;
		Движение.Месяц = СтрокаКорректировки.Месяц;
		Движение.Часы = Цел(СтрокаКорректировки.КоличествоЧасов);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
