#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТипДокумента1 = ПолучитьТипДокументаСЗСтимулированиеНаСервере();
	ТипДокумента2 = ПолучитьТипДокументаРасчетныйЛистПреподавательНаСервере();
	ТипДокумента3 = ПолучитьТипДокументаРасчетныйЛистРуководительНаСервере();
	ТипДокумента4 = ПолучитьТипДокументаРасчетныйЛистТехникНаСервере();

	Оповещение = Новый ОписаниеОповещения(
		"ВыборШаблонаЗавершен",
		ЭтотОбъект,
		Новый Структура("ПараметрКоманды", ПараметрКоманды));

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("ТипДокумента1", ТипДокумента1);
	ПараметрыОткрытия.Вставить("ТипДокумента2", ТипДокумента2);
	ПараметрыОткрытия.Вставить("ТипДокумента3", ТипДокумента3);
	ПараметрыОткрытия.Вставить("ТипДокумента4", ТипДокумента4);

	ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаВыбора", ПараметрыОткрытия, , , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборШаблонаЗавершен(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора <> Неопределено Тогда
		ПараметрыДокумента = ПолучитьПараметрыНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
			
		Для каждого СсылкаНаШаблон Из РезультатВыбора Цикл
			
			Если Не СсылкаНаШаблон.Пустая() Тогда
				ТипДокумента = ПолучитьРеквизитПоСсылке(СсылкаНаШаблон);
				
				Если ТипДокумента = ПолучитьТипДокументаСЗСтимулированиеНаСервере() Тогда
					ПараметрыДокумента = ПолучитьПараметрыНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
					ДокументНаОсновеШаблона(СсылкаНаШаблон, ПараметрыДокумента);
					
				ИначеЕсли ТипДокумента = ПолучитьТипДокументаРасчетныйЛистПреподавательНаСервере() Тогда
					ПараметрыДокумента = ПолучитьПараметрыПреподавательНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
					
					Для каждого Параметр Из ПараметрыДокумента Цикл	
						ДокументНаОсновеШаблона(СсылкаНаШаблон, Параметр.Значение);
					КонецЦикла;
					
				ИначеЕсли ТипДокумента = ПолучитьТипДокументаРасчетныйЛистТехникНаСервере() Тогда
					ПараметрыДокумента = ПолучитьПараметрыТехникНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
					
					Для каждого Параметр Из ПараметрыДокумента Цикл	
						ДокументНаОсновеШаблона(СсылкаНаШаблон, Параметр.Значение);
					КонецЦикла;
					
				ИначеЕсли ТипДокумента = ПолучитьТипДокументаРасчетныйЛистРуководительНаСервере() Тогда
					ПараметрыДокумента = ПолучитьПараметрыРуководительНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
					ДокументНаОсновеШаблона(СсылкаНаШаблон, ПараметрыДокумента);
				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТипДокументаСЗСтимулированиеНаСервере()

	Возврат Перечисления.ТипыДокументов.СЗСтимулирование;

КонецФункции

&НаСервере
Функция ПолучитьРеквизитПоСсылке(Знач Ссылка)

	Возврат Ссылка.ТипДокумента;

КонецФункции

&НаСервере
Функция ПолучитьТипДокументаРасчетныйЛистПреподавательНаСервере()

	Возврат Перечисления.ТипыДокументов.РасчетныйЛистПреподаватель;

КонецФункции

&НаСервере
Функция ПолучитьТипДокументаРасчетныйЛистРуководительНаСервере()

	Возврат Перечисления.ТипыДокументов.РасчетныйЛистРуководитель;

КонецФункции

&НаСервере
Функция ПолучитьТипДокументаРасчетныйЛистТехникНаСервере()

	Возврат Перечисления.ТипыДокументов.РасчетныйЛистТехник;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыНаСервере(Знач Ссылка)

	ПараметрыДокумента = Новый Структура();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УтвержденПриказом.Значение КАК Приказ,
	|	ШифрПроекта.Значение КАК ШифрПроекта,
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	РасчетССотрудниками.ДатаВыплаты КАК ДатаВыплаты,
	|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК НаименованиеПрограммыСокращенно,
	|	СТРОКА(УчебныеПрограммы.Код) КАК Код,
	|	СТРОКА(СотрудникиСогласован1.Наименование) КАК ИОСогласован1,
	|	СТРОКА(СотрудникиСогласован2.Наименование) КАК ИОСогласован2,
	|	РасчетССотрудниками.Согласовано1Должность КАК Согласовано1Должность,
	|	РасчетССотрудниками.Согласовано2Должность КАК Согласовано2Должность,
	|	КодОбеспечения.Значение КАК КодОбеспечения,
	|	ИндексПроекта.Значение КАК ИндексПроекта
	|ИЗ
	|	Константа.ШифрПроекта КАК ШифрПроекта,
	|	Константа.УтвержденПриказом КАК УтвержденПриказом,
	|	Документ.РасчетССотрудниками КАК РасчетССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО РасчетССотрудниками.Программа = УчебныеПрограммы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован1
	|		ПО РасчетССотрудниками.Согласовано1 = СотрудникиСогласован1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован2
	|		ПО РасчетССотрудниками.Согласовано2 = СотрудникиСогласован2.Ссылка,
	|	Константа.ИндексПроекта КАК ИндексПроекта,
	|	Константа.КодОбеспечения КАК КодОбеспечения
	|ГДЕ
	|	РасчетССотрудниками.Ссылка = &Ссылка";   

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл		
		ГодВыплаты = Строка(Формат(Выборка.ДатаВыплаты, "ДФ=гггг"));
		Месяц = НРег(Формат(Выборка.ДатаВыплаты, "ДФ=ММММ"));
		МесяцПредложныйПадеж = ПолучитьСклоненияСтроки(
			НРег(Формат(Выборка.ДатаВыплаты, "ДФ=ММММ")), ,
			"ПД=Предложный")[0];
		ПараметрыДокумента.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		ПараметрыДокумента.Вставить("НаименованиеПрограммыСокращенно", Выборка.НаименованиеПрограммыСокращенно);
		ПараметрыДокумента.Вставить("ШифрПроекта", Выборка.ШифрПроекта);
		ПараметрыДокумента.Вставить("ИндексПроекта", Выборка.ИндексПроекта);
		ПараметрыДокумента.Вставить("КодОбеспечения", Выборка.КодОбеспечения);
		ПараметрыДокумента.Вставить("УтвержденПриказом", Выборка.Приказ);
		ПараметрыДокумента.Вставить("МесяцВыплаты", МесяцПредложныйПадеж); 
		ПараметрыДокумента.Вставить(
			"ИмяФайла",
			Выборка.Код
			+ " "
			+ Выборка.НаименованиеПрограммыСокращенно
			+ " СЗ стимулирование за "
			+ Месяц);
		ПараметрыДокумента.Вставить("Согласовано1", ИнициалыИФамилияИзСтроки(Выборка.ИОСогласован1));
		ПараметрыДокумента.Вставить("Согласовано1Должность", Выборка.Согласовано1Должность);
		ПараметрыДокумента.Вставить("Согласовано2", ИнициалыИФамилияИзСтроки(Выборка.ИОСогласован2));
		ПараметрыДокумента.Вставить("Согласовано2Должность", Выборка.Согласовано2Должность);
	КонецЦикла;
		
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Наименование КАК ФИО,
	|	УчебныеПрограммы.НомерГруппы КАК НомерГруппы,
	|	РасчетПоПроведениюЗанятий.КоличествоЧасов КАК КоличествоЧасов,
	|	РасчетПоПроведениюЗанятий.КВыплате КАК КВыплате,
	|	РасчетПоПроведениюЗанятий.Должность КАК Должность,
	|	ИСТИНА КАК ЭтоПреподаватель,
	|	ПРЕДСТАВЛЕНИЕ(РасчетПоПроведениюЗанятий.Месяц) КАК МесяцПредставление
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоПроведениюЗанятий КАК РасчетПоПроведениюЗанятий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетПоПроведениюЗанятий.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО (Сотрудники.Ссылка = УчебныеПрограммы.РуководительПрограммы)
	|ГДЕ
	|	РасчетПоПроведениюЗанятий.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.Наименование,
	|	УчебныеПрограммы.НомерГруппы,
	|	РасчетПоТехническомуСопровождению.КоличествоЧасов,
	|	РасчетПоТехническомуСопровождению.КВыплате,
	|	РасчетПоТехническомуСопровождению.Должность,
	|	ЛОЖЬ,
	|	ПРЕДСТАВЛЕНИЕ(РасчетПоТехническомуСопровождению.Месяц)
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоТехническомуСопровождению КАК РасчетПоТехническомуСопровождению
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетПоТехническомуСопровождению.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО (Сотрудники.Ссылка = УчебныеПрограммы.РуководительПрограммы)
	|ГДЕ
	|	РасчетПоТехническомуСопровождению.Ссылка = &Ссылка";

	СписокСотрудников = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ФИО = Неопределено Тогда
			Сотрудник = Новый Массив(6);
			Сотрудник[0] = Выборка.ФИО;
			Сотрудник[1] = Выборка.Должность;
			Сотрудник[2] = Выборка.НомерГруппы;
			
			ПодстрокаПоиска = ЧислоПрописью(Выборка.КоличествоЧасов, , "час,часа,часов,м,,,,,0");
			ПодстрокаЗамены = ЧислоПрописью(Выборка.КоличествоЧасов, , ",,,,,,,,0");
			Фраза = Строка(Выборка.КоличествоЧасов)
				+ " "
				+ СокрЛП(СтрЗаменить(ПодстрокаПоиска, ПодстрокаЗамены, ""));
			
			Сотрудник[3] = Строка(Выборка.МесяцПредставление) + " - " + Фраза;
			Сотрудник[4] = Выборка.КВыплате;
			Сотрудник[5] = Выборка.ЭтоПреподаватель;
			СписокСотрудников.Добавить(Сотрудник);
		КонецЕсли;
	КонецЦикла;

	ПараметрыДокумента.Вставить("ФИО", СписокСотрудников);
	ПараметрыДокумента.Вставить("Тип", 
	ПредопределенноеЗначение("Перечисление.ТипыДокументов.СЗСтимулирование"));	

	Возврат ПараметрыДокумента;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыПреподавательНаСервере(Знач Ссылка)
	
	ПараметрыДокумента = Новый Структура();
	Ключ = "Ключ";
	Счетчик = 0;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Наименование КАК ФИО,
	|	РасчетПоПроведениюЗанятий.КоличествоЧасов КАК КоличествоЧасов,
	|	РасчетПоПроведениюЗанятий.КВыплате КАК КВыплате,
	|	РасчетПоПроведениюЗанятий.Должность КАК Должность,
	|	ПРЕДСТАВЛЕНИЕ(РасчетПоПроведениюЗанятий.Месяц) КАК Месяц,
	|	РасчетПоПроведениюЗанятий.К1 КАК К1,
	|	РасчетПоПроведениюЗанятий.К2 КАК К2,
	|	РасчетПоПроведениюЗанятий.К3 КАК К3,
	|	ЕСТЬNULL(Сотрудники.Степень, ""без степени"") КАК Степень,
	|	РасчетПоПроведениюЗанятий.Тариф КАК Тариф,
	|	ПРЕДСТАВЛЕНИЕ(УчебныеПрограммы.РуководительПрограммы) КАК РуководительПрограммы,
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	РасчетПоПроведениюЗанятий.РазмерОклада КАК Оклад,
	|	РасчетПоПроведениюЗанятий.Месяц КАК МесяцПеречисление,
	|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК НаименованиеПрограммыСокращенно,
	|	РасчетПоПроведениюЗанятий.НормаЧасов КАК НормаЧасов,
	|	РасчетПоПроведениюЗанятий.Ссылка.ДатаВыплаты КАК ДатаВыплаты,
	|	РасчетПоПроведениюЗанятий.СтоимостьЧаса КАК СтоимостьЧаса
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоПроведениюЗанятий КАК РасчетПоПроведениюЗанятий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетПоПроведениюЗанятий.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО РасчетПоПроведениюЗанятий.Ссылка.Программа = УчебныеПрограммы.Ссылка
	|ГДЕ
	|	РасчетПоПроведениюЗанятий.Ссылка = &Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НовыйСотрудник = Новый Структура();
		
		Должность = ПолучитьСклоненияСтроки(НРег(Выборка.Должность), , "ПД=Родительный")[0];
		Степень = НРег(Выборка.Степень);
		ГодВыплаты = Строка(Формат(Выборка.ДатаВыплаты, "ДФ=гггг"));
		МесяцВыплаты = Выборка.Месяц + " " + ГодВыплаты;
		
		Формат = "ЧДЦ=2; ЧРГ=' '";

		НовыйСотрудник.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		НовыйСотрудник.Вставить("Сотрудник", Выборка.ФИО);
		НовыйСотрудник.Вставить("Должность", Должность);
		НовыйСотрудник.Вставить("Итого", Формат(Выборка.КВыплате, Формат));
		НовыйСотрудник.Вставить("МесяцВыплаты", МесяцВыплаты);
		НовыйСотрудник.Вставить("Оклад", Формат(Выборка.Оклад, Формат));
		НовыйСотрудник.Вставить("НормаЧасов", Выборка.НормаЧасов);
		НовыйСотрудник.Вставить("ТарифИтог", Формат(Выборка.СтоимостьЧаса, Формат));
		НовыйСотрудник.Вставить("ТарифРасчет", Формат(Выборка.Тариф, Формат));
		НовыйСотрудник.Вставить("К1", Выборка.К1);
		НовыйСотрудник.Вставить("К2", Выборка.К2);
		НовыйСотрудник.Вставить("К3", Выборка.К3);
		НовыйСотрудник.Вставить("Дата", Выборка.ДатаВыплаты);
		НовыйСотрудник.Вставить("Часы", Выборка.КоличествоЧасов);
		НовыйСотрудник.Вставить("РуководительИО", ФамилияИИнициалыИзСтроки(Выборка.РуководительПрограммы));
		НовыйСотрудник.Вставить("Степень", Степень);
		НовыйСотрудник.Вставить(
			"ИмяФайла",
			"Расчет_оплаты_преподаватель_"
			+ Выборка.НаименованиеПрограммыСокращенно
			+ "_"
			+ Выборка.ФИО
			+ "_"
			+ МесяцВыплаты);
		НовыйСотрудник.Вставить(
			"Тип", 
			ПредопределенноеЗначение("Перечисление.ТипыДокументов.РасчетныйЛистПреподаватель"));	
			
		КлючСтруктуры = Ключ + Строка(Счетчик);
		ПараметрыДокумента.Вставить(КлючСтруктуры, НовыйСотрудник);
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Возврат ПараметрыДокумента;
	
КонецФункции
	
&НаСервере
Функция ПолучитьПараметрыРуководительНаСервере(Знач Ссылка)
	
	ПараметрыДокумента = Новый Структура();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Должность) КАК ДолжностьРуководителя,
	|	СТРОКА(Сотрудники.Наименование) КАК Руководитель,
	|	РасчетССотрудниками.КоличествоСтудентов КАК КоличествоСтудентов,
	|	РасчетССотрудниками.КВыплатеРуководителю КАК КВыплатеРуководителю,
	|	ПРЕДСТАВЛЕНИЕ(РасчетССотрудниками.Месяц) КАК Месяц,
	|	СТРОКА(СтруктурныеПодразделения.Наименование) КАК КафедраРуководителя,
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	УчебныеПрограммы.КоличествоУчебныхЧасов КАК ОбъемПрограммы,
	|	РасчетССотрудниками.ДатаВыплаты КАК Дата,
	|	РасчетССотрудниками.РазмерОкладаРуководителя КАК Оклад,
	|	РасчетССотрудниками.ТарифРуководителя КАК Тариф,
	|	РасчетССотрудниками.НормаЧасовРуководителя КАК НормаЧасов,
	|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК НаименованиеПрограммыСокращенно,
	|	ПРЕДСТАВЛЕНИЕ(РасчетССотрудниками.СтепеньРуководителя) КАК СтепеньРуководителя,
	|	РасчетССотрудниками.Месяц КАК МесяцПеречисление
	|ИЗ
	|	Документ.РасчетССотрудниками КАК РасчетССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетССотрудниками.Руководитель = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеПодразделения КАК СтруктурныеПодразделения
	|		ПО РасчетССотрудниками.КафедраРуководителя = СтруктурныеПодразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО РасчетССотрудниками.Программа = УчебныеПрограммы.Ссылка
	|ГДЕ
	|	РасчетССотрудниками.Ссылка = &Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Кафедра = ПолучитьСклоненияСтроки(Выборка.КафедраРуководителя, , "ПД=Родительный")[0]; 
		Должность = ПолучитьСклоненияСтроки(НРег(Выборка.ДолжностьРуководителя), , "ПД=Винительный")[0];
		Степень = ПолучитьСклоненияСтроки(НРег(Выборка.СтепеньРуководителя), , "ПД=Винительный")[0];
		ГодВыплаты = Строка(Формат(Выборка.Дата, "ДФ=гггг"));
		МесяцВыплаты = Выборка.Месяц + " " + ГодВыплаты;
		
		Формат = "ЧДЦ=2; ЧРГ=' '";

		ПараметрыДокумента.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		ПараметрыДокумента.Вставить("Сотрудник", Выборка.Руководитель);
		ПараметрыДокумента.Вставить("Должность", Нрег(Выборка.ДолжностьРуководителя));
		ПараметрыДокумента.Вставить("Кафедра", Кафедра);
		ПараметрыДокумента.Вставить("Итого", Формат(Выборка.КВыплатеРуководителю, Формат));
		ПараметрыДокумента.Вставить("МесяцВыплаты", МесяцВыплаты);
		ПараметрыДокумента.Вставить("КоличествоСтудентов", Выборка.КоличествоСтудентов);
		ПараметрыДокумента.Вставить("Оклад", Формат(Выборка.Оклад, Формат));
		ПараметрыДокумента.Вставить("НормаЧасов", Выборка.НормаЧасов);
		ПараметрыДокумента.Вставить("СтоимостьЧаса", Формат(Выборка.Тариф, Формат));
		ПараметрыДокумента.Вставить("ОбъемПрограммы", Выборка.ОбъемПрограммы);
		ПараметрыДокумента.Вставить("Дата", Выборка.Дата);
		ПараметрыДокумента.Вставить(
				"ПервыйДеньМесяцаВыплаты",
				Дата(ГодВыплаты, ПолучитьНомерМесяца(Выборка.МесяцПеречисление), 1));
		ПараметрыДокумента.Вставить("ДолжностьСтепень", Должность + ", " + Степень);
		ПараметрыДокумента.Вставить(
			"ИмяФайла",
			"Расчет_оплаты_руководитель_"
			+ Выборка.НаименованиеПрограммыСокращенно
			+ "_"
			+ МесяцВыплаты);
	КонецЦикла;
	
	ПараметрыДокумента.Вставить(
		"Тип", 
		ПредопределенноеЗначение("Перечисление.ТипыДокументов.РасчетныйЛистРуководитель"));

	Возврат ПараметрыДокумента;
	
КонецФункции
	
&НаСервере
Функция ПолучитьПараметрыТехникНаСервере(Знач Ссылка)
	
	ПараметрыДокумента = Новый Структура();
	Ключ = "Ключ";
	Счетчик = 0;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Наименование КАК ФИО,
	|	ПРЕДСТАВЛЕНИЕ(УчебныеПрограммы.РуководительПрограммы) КАК РуководительПрограммы,
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК НаименованиеПрограммыСокращенно,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.Должность КАК Должность,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.КВыплате КАК КВыплате,
	|	ПРЕДСТАВЛЕНИЕ(РасчетССотрудникамиРасчетПоТехническомуСопровождению.Месяц) КАК Месяц,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.РазмерОклада КАК Оклад,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.НормаЧасов КАК НормаЧасов,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.К4 КАК К4,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.Ссылка.ДатаВыплаты КАК ДатаВыплаты,
	|	РасчетССотрудникамиРасчетПоТехническомуСопровождению.КоличествоЧасов КАК КоличествоЧасов
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоТехническомуСопровождению КАК РасчетССотрудникамиРасчетПоТехническомуСопровождению
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетССотрудникамиРасчетПоТехническомуСопровождению.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО РасчетССотрудникамиРасчетПоТехническомуСопровождению.Ссылка.Программа = УчебныеПрограммы.Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НовыйСотрудник = Новый Структура();
		
		Должность = ПолучитьСклоненияСтроки(НРег(Выборка.Должность), , "ПД=Родительный")[0];
		ГодВыплаты = Строка(Формат(Выборка.ДатаВыплаты, "ДФ=гггг"));
		МесяцВыплаты = Выборка.Месяц + " " + ГодВыплаты;
		
		Формат = "ЧДЦ=2; ЧРГ=' '";

		НовыйСотрудник.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		НовыйСотрудник.Вставить("Сотрудник", Выборка.ФИО);
		НовыйСотрудник.Вставить("Должность", Должность);
		НовыйСотрудник.Вставить("Итого", Формат(Выборка.КВыплате, Формат));
		НовыйСотрудник.Вставить("МесяцВыплаты", МесяцВыплаты);
		НовыйСотрудник.Вставить("Оклад", Формат(Выборка.Оклад, Формат));
		НовыйСотрудник.Вставить("НормаЧасов", Выборка.НормаЧасов);
		НовыйСотрудник.Вставить("К4", Выборка.К4);
		НовыйСотрудник.Вставить("Дата", Выборка.ДатаВыплаты);
		НовыйСотрудник.Вставить("Часы", Выборка.КоличествоЧасов);
		НовыйСотрудник.Вставить("РуководительИО", ФамилияИИнициалыИзСтроки(Выборка.РуководительПрограммы));
		НовыйСотрудник.Вставить(
			"ИмяФайла",
			"Расчет_оплаты_техник_"
			+ Выборка.НаименованиеПрограммыСокращенно
			+ "_"
			+ Выборка.ФИО
			+ "_"
			+ МесяцВыплаты);
		НовыйСотрудник.Вставить(
			"Тип", 
			ПредопределенноеЗначение("Перечисление.ТипыДокументов.РасчетныйЛистТехник"));	
			
		КлючСтруктуры = Ключ + Строка(Счетчик);
		ПараметрыДокумента.Вставить(КлючСтруктуры, НовыйСотрудник);
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Возврат ПараметрыДокумента;
	
КонецФункции	

&НаСервере
Функция ПолучитьНомерМесяца(Месяц)

	Возврат Перечисления.МесяцыГода.Индекс(Месяц) + 1;

КонецФункции	

&НаСервере
Функция РазбитьФИО(ПолноеФИО)
	
	Результат = Новый Структура("Фамилия,Имя,Отчество", "", "", "");
	
	Если ПустаяСтрока(ПолноеФИО) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Части = СтрРазделить(СокрЛП(ПолноеФИО), " ", Ложь);
	
	Если Части.Количество() > 0 Тогда
		Результат.Фамилия = Части[0];
	КонецЕсли;
	
	Если Части.Количество() > 1 Тогда
		Результат.Имя = Части[1];
	КонецЕсли;
	
	Если Части.Количество() > 2 Тогда
		Результат.Отчество = Части[2];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ИнициалыИФамилияИзСтроки(ПолноеФИО)

	ФИО = РазбитьФИО(ПолноеФИО);
	
	Результат = "";

	Если Не ПустаяСтрока(ФИО.Имя) Тогда
		Результат = Лев(ФИО.Имя, 1) + ".";

		Если Не ПустаяСтрока(ФИО.Отчество) Тогда
			Результат = Результат + Лев(ФИО.Отчество, 1) + ".";
		КонецЕсли;
	КонецЕсли;

	Возврат СокрЛП(Результат + " " + ФИО.Фамилия);

КонецФункции

&НаСервере
Функция ФамилияИИнициалыИзСтроки(ПолноеФИО)

	ФИО = РазбитьФИО(ПолноеФИО);
	
	Результат = "";

	Если Не ПустаяСтрока(ФИО.Имя) И Не ПустаяСтрока(ФИО.Фамилия) Тогда
		Результат = ФИО.Фамилия;
		Результат = Результат + " " + Лев(ФИО.Имя, 1) + ".";

		Если Не ПустаяСтрока(ФИО.Отчество) Тогда
			Результат = Результат + Лев(ФИО.Отчество, 1) + ".";
		КонецЕсли;
	КонецЕсли;

	Возврат СокрЛП(Результат);

КонецФункции

#КонецОбласти