#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТипДокумента = ПолучитьТипДокументаНаСервере();

	Оповещение = Новый ОписаниеОповещения(
		"ВыборШаблонаЗавершен",
		ЭтотОбъект,
		Новый Структура("ПараметрКоманды", ПараметрКоманды));

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("ТипДокумента", ТипДокумента);	

	ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаВыбора", ПараметрыОткрытия, , , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборШаблонаЗавершен(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора <> Неопределено Тогда
		СсылкаНаШаблон = РезультатВыбора;
		
		Если Не СсылкаНаШаблон.Пустая() Тогда
			ПараметрыДокумента = ПолучитьПараметрыНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
			ФайлWord = ДокументWordНаОсновеШаблона(СсылкаНаШаблон, ПараметрыДокумента);
			
			Если ФайлWord <> Неопределено Тогда
				ЗапуститьПриложение(ФайлWord);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТипДокументаНаСервере()

	Возврат Перечисления.ТипыДокументов.СЗСтимулирование;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыНаСервере(Знач Ссылка)

	ПараметрыДокумента = Новый Структура();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УтвержденПриказом.Значение КАК Приказ,
	|	ШифрПроекта.Значение КАК ШифрПроекта,
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	РасчетССотрудниками.ДатаВыплаты КАК ДатаВыплаты,
	|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК НаименованиеПрограммыСокращенно,
	|	СТРОКА(УчебныеПрограммы.Код) КАК Код,
	|	СТРОКА(СотрудникиСогласован1.Наименование) КАК ИОСогласован1,
	|	СТРОКА(СотрудникиСогласован2.Наименование) КАК ИОСогласован2,
	|	СТРОКА(СотрудникиСогласован3.Наименование) КАК ИОСогласован3,
	|	РасчетССотрудниками.Согласовано1Должность КАК Согласовано1Должность,
	|	РасчетССотрудниками.Согласовано2Должность КАК Согласовано2Должность,
	|	РасчетССотрудниками.Согласовано3Должность КАК Согласовано3Должность
	|ИЗ
	|	Константа.ШифрПроекта КАК ШифрПроекта,
	|	Константа.УтвержденПриказом КАК УтвержденПриказом,
	|	Документ.РасчетССотрудниками КАК РасчетССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО РасчетССотрудниками.Программа = УчебныеПрограммы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован1
	|		ПО РасчетССотрудниками.Согласовано1 = СотрудникиСогласован1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован2
	|		ПО РасчетССотрудниками.Согласовано2 = СотрудникиСогласован2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован3
	|		ПО РасчетССотрудниками.Согласовано3 = СотрудникиСогласован3.Ссылка
	|ГДЕ
	|	РасчетССотрудниками.Ссылка = &Ссылка";   

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл		
		ГодВыплаты = Строка(Формат(Выборка.ДатаВыплаты, "ДФ=гггг"));
		МесяцВыплаты = НРег(Формат(Выборка.ДатаВыплаты, "ДФ=ММММ"));
		МесяцВыплатыПредложныйПадеж = ПолучитьСклоненияСтроки(
			НРег(Формат(Выборка.ДатаВыплаты, "ДФ=ММММ")), ,
			"ПД=Предложный")[0];
		ПараметрыДокумента.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		ПараметрыДокумента.Вставить("ШифрПроекта", Выборка.ШифрПроекта);
		ПараметрыДокумента.Вставить("Приказ", Выборка.Приказ);
		ПараметрыДокумента.Вставить("ДатаВыплаты", МесяцВыплатыПредложныйПадеж + " " + ГодВыплаты); 
		ПараметрыДокумента.Вставить(
			"ИмяФайла",
			Выборка.Код
			+ " "
			+ Выборка.НаименованиеПрограммыСокращенно
			+ " СЗ стимулирование за "
			+ МесяцВыплаты);
		ПараметрыДокумента.Вставить("Согласовано1", Выборка.ИОСогласован1);
		ПараметрыДокумента.Вставить("Согласовано1Должность", Выборка.Согласовано1Должность);
		ПараметрыДокумента.Вставить("Согласовано2", Выборка.ИОСогласован2);
		ПараметрыДокумента.Вставить("Согласовано2Должность", Выборка.Согласовано2Должность);
		ПараметрыДокумента.Вставить("Согласовано3", Выборка.ИОСогласован3);
		ПараметрыДокумента.Вставить("Согласовано3Должность", Выборка.Согласовано3Должность);
	КонецЦикла;
		
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Наименование КАК ФИО,
	|	УчебныеПрограммы.НомерГруппы КАК НомерГруппы,
	|	РасчетПоПроведениюЗанятий.КоличествоЧасов КАК КоличествоЧасов,
	|	РасчетПоПроведениюЗанятий.КВыплате КАК КВыплате,
	|	РасчетПоПроведениюЗанятий.Должность КАК Должность,
	|	ИСТИНА КАК ЭтоПреподаватель,
	|	ПРЕДСТАВЛЕНИЕ(РасчетПоПроведениюЗанятий.Месяц) КАК МесяцПредставление
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоПроведениюЗанятий КАК РасчетПоПроведениюЗанятий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетПоПроведениюЗанятий.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО (Сотрудники.Ссылка = УчебныеПрограммы.РуководительПрограммы)
	|ГДЕ
	|	РасчетПоПроведениюЗанятий.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.Наименование,
	|	УчебныеПрограммы.НомерГруппы,
	|	РасчетПоТехническомуСопровождению.КоличествоЧасов,
	|	РасчетПоТехническомуСопровождению.КВыплате,
	|	РасчетПоТехническомуСопровождению.Должность,
	|	ЛОЖЬ,
	|	ПРЕДСТАВЛЕНИЕ(РасчетПоТехническомуСопровождению.Месяц)
	|ИЗ
	|	Документ.РасчетССотрудниками.РасчетПоТехническомуСопровождению КАК РасчетПоТехническомуСопровождению
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО РасчетПоТехническомуСопровождению.ФИО = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО (Сотрудники.Ссылка = УчебныеПрограммы.РуководительПрограммы)
	|ГДЕ
	|	РасчетПоТехническомуСопровождению.Ссылка = &Ссылка";

	СписокСотрудников = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ФИО = Неопределено Тогда
			Сотрудник = Новый Массив(6);
			Сотрудник[0] = Выборка.ФИО;
			Сотрудник[1] = Выборка.Должность;
			Сотрудник[2] = Выборка.НомерГруппы;
			
			ПодстрокаПоиска = ЧислоПрописью(Выборка.КоличествоЧасов, , "час,часа,часов,м,,,,,0");
			ПодстрокаЗамены = ЧислоПрописью(Выборка.КоличествоЧасов, , ",,,,,,,,0");
			Фраза = Строка(Выборка.КоличествоЧасов)
				+ " "
				+ СокрЛП(СтрЗаменить(ПодстрокаПоиска, ПодстрокаЗамены, ""));
			
			Сотрудник[3] = Строка(Выборка.МесяцПредставление) + " - " + Фраза;
			Сотрудник[4] = Выборка.КВыплате;
			Сотрудник[5] = Выборка.ЭтоПреподаватель;
			СписокСотрудников.Добавить(Сотрудник);
		КонецЕсли;
	КонецЦикла;

	ПараметрыДокумента.Вставить("ФИО", СписокСотрудников);
	ПараметрыДокумента.Вставить("Тип", 
	ПредопределенноеЗначение("Перечисление.ТипыДокументов.СЗСтимулирование"));	

	Возврат ПараметрыДокумента;

КонецФункции

#КонецОбласти