
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТипДокумента = ПолучитьТипДокументаНаСервере();
	
	Оповещение = Новый ОписаниеОповещения(
		"ВыборШаблонаЗавершен",
		ЭтотОбъект,
		Новый Структура("ПараметрКоманды", ПараметрКоманды));
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("ТипДокумента", ТипДокумента);
	
	ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаВыбора", ПараметрыОткрытия, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборШаблонаЗавершен(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		СсылкаНаШаблон = РезультатВыбора;
		
		Если Не СсылкаНаШаблон.Пустая() Тогда
			ПараметрыДокумента = ПолучитьПараметрыНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
			ФайлWord = ДокументНаОсновеШаблона(СсылкаНаШаблон, ПараметрыДокумента);
			
			Если ФайлWord <> Неопределено Тогда
				ЗапуститьПриложение(ФайлWord);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипДокументаНаСервере()
	
	Возврат Перечисления.ТипыДокументов.ОрганизационныйПриказ;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыНаСервере(Знач Ссылка)
	
	ПараметрыДокумента = Новый Структура();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	УчебныеПрограммы.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
	|	Сотрудники.Подразделение КАК КафедраРуководителя,
	|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Должность) КАК ДолжностьРуководителяПрограммы,
	|	ЕСТЬNULL(СтруктурныеПодразделения.Родитель.Наименование, """") КАК ФакультетРуководителя,
	|	ЕСТЬNULL(СтруктурныеПодразделения.Родитель.Родитель.Наименование, """") КАК ИнститутРуководителя,
	|	СТРОКА(Сотрудники.Наименование) КАК ФиоРуководителяПрограммы,
	|	ОрганизационныйПриказНаКурс.ПодписантДолжность КАК ПодписантДолжность,
	|	СТРОКА(СотрудникиПодписант.Наименование) КАК ПодписантФамилияИО,
	|	ОрганизационныйПриказНаКурс.ПроектПриказаВноситДолжность КАК ПроектПриказаВноситДолжность,
	|	СТРОКА(СотрудникиПроект.Наименование) КАК ПроектПриказаВноситИОФамилия,
	|	ОрганизационныйПриказНаКурс.Согласовано1Должность КАК Согласовано1Должность,
	|	СТРОКА(СотрудникиСогласован1.Наименование) КАК Согласовано1ИОФамилия,
	|	ОрганизационныйПриказНаКурс.Согласовано2Должность КАК Согласовано2Должность,
	|	СТРОКА(СотрудникиСогласован2.Наименование) КАК Согласовано2ИОФамилия
	|ИЗ
	|	Документ.ОрганизационныйПриказНаКурс КАК ОрганизационныйПриказНаКурс
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО ОрганизационныйПриказНаКурс.Программа = УчебныеПрограммы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (УчебныеПрограммы.РуководительПрограммы = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеПодразделения КАК СтруктурныеПодразделения
	|		ПО (Сотрудники.Подразделение = СтруктурныеПодразделения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиПодписант
	|		ПО ОрганизационныйПриказНаКурс.Подписант = СотрудникиПодписант.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиПроект
	|		ПО ОрганизационныйПриказНаКурс.ПроектПриказаВносит = СотрудникиПроект.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован1
	|		ПО ОрганизационныйПриказНаКурс.Согласовано1 = СотрудникиСогласован1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СотрудникиСогласован2
	|		ПО ОрганизационныйПриказНаКурс.Согласовано2 = СотрудникиСогласован2.Ссылка
	|ГДЕ
	|	ОрганизационныйПриказНаКурс.Ссылка = &Ссылка";   
	
	Выборка = Запрос.Выполнить().Выбрать();

	ФорматРодительныйПадеж = "ПД=Родительный";
	ФорматВинительныйПадеж = "ПД=Винительный";
	
	Пока Выборка.Следующий() Цикл	
		ПараметрыДокумента.Вставить("ИмяФайла", "ОРГприказ ДПП ПП " + Выборка.НаименованиеПрограммы);
		ПараметрыДокумента.Вставить("НаименованиеПрограммы", Выборка.НаименованиеПрограммы);
		КоличествоУчебныхЧасовСклонение = ПолучитьСклоненияСтрокиПоЧислу("час", Выборка.КоличествоУчебныхЧасов)[0];
		ПараметрыДокумента.Вставить("КоличествоУчебныхЧасов", КоличествоУчебныхЧасовСклонение);
      	КафедраРуководителя = ПолучитьСклоненияСтроки(Выборка.КафедраРуководителя, , ФорматРодительныйПадеж)[0];
		
		Если Не ПустаяСтрока(Выборка.ФакультетРуководителя) Тогда
			ФакультетРуководителя = ПолучитьСклоненияСтроки(Выборка.ФакультетРуководителя, , ФорматРодительныйПадеж)[0];
			
		Иначе                   
			ФакультетРуководителя = "";
		КонецЕсли;
		
		Если Не ПустаяСтрока(Выборка.ИнститутРуководителя) Тогда
			ИнститутРуководителя = ПолучитьСклоненияСтроки(Выборка.ИнститутРуководителя, , ФорматРодительныйПадеж)[0];
			
		Иначе                   
			ИнститутРуководителя = "";
		КонецЕсли; 
		
		ДолжностьРуководителяПрограммы = ПолучитьСклоненияСтроки(
			Выборка.ДолжностьРуководителяПрограммы, ,
			ФорматВинительныйПадеж)[0];
		ФИОРуководителяПрограммы = ПолучитьСклоненияСтроки(
			ФамилияИИнициалыИзСтроки(Выборка.ФИОРуководителяПрограммы), ,
			ФорматВинительныйПадеж)[0];
		СтруктурноеПодразделениеРуководителя = КафедраРуководителя 
			+ " "
			+ ФакультетРуководителя
			+ " "
			+ ИнститутРуководителя;
		
		ПараметрыДокумента.Вставить("СтруктурногоПодразделенияРуководителя", СтруктурноеПодразделениеРуководителя);
		ПараметрыДокумента.Вставить(
			"ДолжностьФиоРуководителяПрограммы",
			ДолжностьРуководителяПрограммы
				+ " "
				+ СтруктурноеПодразделениеРуководителя
				+ " "
				+ ФамилияИИнициалыИзСтроки(ФИОРуководителяПрограммы));
		ПараметрыДокумента.Вставить("ПодписантДолжность", Выборка.ПодписантДолжность);
		ПараметрыДокумента.Вставить("ПодписантФамилияИО", ФамилияИИнициалыИзСтроки(Выборка.ПодписантФамилияИО));
		ПараметрыДокумента.Вставить("ПроектПриказаВноситДолжность", Выборка.ПроектПриказаВноситДолжность);
		ПараметрыДокумента.Вставить(
			"ПроектПриказаВноситИОФамилия",
			ИнициалыИФамилияИзСтроки(Выборка.ПроектПриказаВноситИОФамилия));
		ПараметрыДокумента.Вставить("Согласовано1Должность", Выборка.Согласовано1Должность);
		ПараметрыДокумента.Вставить("Согласовано1ИОФамилия", ИнициалыИФамилияИзСтроки(Выборка.Согласовано1ИОФамилия));
		ПараметрыДокумента.Вставить("Согласовано2Должность", Выборка.Согласовано2Должность);
		ПараметрыДокумента.Вставить("Согласовано2ИОФамилия", ИнициалыИФамилияИзСтроки(Выборка.Согласовано2ИОФамилия));		
	КонецЦикла;
	
	ПараметрыДокумента.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыДокументов.ОрганизационныйПриказ"));
	
	Возврат ПараметрыДокумента; 
	
КонецФункции

&НаСервере
Функция РазбитьФИО(ПолноеФИО)

	Результат = Новый Структура("Фамилия,Имя,Отчество", "", "", "");
	
	Если ПустаяСтрока(ПолноеФИО) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Части = СтрРазделить(СокрЛП(ПолноеФИО), " ", Ложь);
	
	Если Части.Количество() > 0 Тогда
		Результат.Фамилия = Части[0];
	КонецЕсли;
	
	Если Части.Количество() > 1 Тогда
		Результат.Имя = Части[1];
	КонецЕсли;
	
	Если Части.Количество() > 2 Тогда
		Результат.Отчество = Части[2];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ФамилияИИнициалыИзСтроки(ПолноеФИО)

	ФИО = РазбитьФИО(ПолноеФИО);
	
	Результат = ФИО.Фамилия;
	
	Если Не ПустаяСтрока(ФИО.Имя) Тогда
		Результат = Результат + " " + Лев(ФИО.Имя, 1) + ".";
	
		Если Не ПустаяСтрока(ФИО.Отчество) Тогда
			Результат = Результат + Лев(ФИО.Отчество, 1) + ".";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ИнициалыИФамилияИзСтроки(ПолноеФИО)

	ФИО = РазбитьФИО(ПолноеФИО);
	
	Результат = "";

	Если Не ПустаяСтрока(ФИО.Имя) Тогда
		Результат = Лев(ФИО.Имя, 1) + ".";

		Если Не ПустаяСтрока(ФИО.Отчество) Тогда
			Результат = Результат + Лев(ФИО.Отчество, 1) + ".";
		КонецЕсли;
	КонецЕсли;

	Возврат СокрЛП(Результат + " " + ФИО.Фамилия);

КонецФункции
