#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнен преподаватель";
		СообщениеПользователю.Поле = "Преподаватель";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнен месяц";
		СообщениеПользователю.Поле = "Месяц";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);
	ЭлементБлокировки.УстановитьЗначение("Месяц", Месяц);
	Блокировка.Заблокировать();
	
	Движения.НагрузкаПреподавателей.Записывать = Истина;
	
	КоличествоПар = 0;
	Для Каждого Строка ИЗ Занятия Цикл
		
		Если НЕ Строка.ЗагруженИзJSON Тогда
			КоличествоПар = КоличествоПар + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	СуммаЧасов = КоличествоПар * 2;
	
	Если СуммаЧасов > 0 Тогда
		Движение = Движения.НагрузкаПреподавателей.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = Преподаватель;
		Движение.Месяц = Месяц;
		Движение.Часы = СуммаЧасов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
