
&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	Объект.ПодписантДолжность = ПолучитьШаблонДолжностиНаСервере(Объект.Подписант);

КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонДолжностиНаСервере(ФИО)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", ФИО);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ДолжностьШаблон КАК ДолжностьШаблон
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДолжностьШаблон;  
    КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПроектПриказаВноситПриИзменении(Элемент)
	
	Объект.ПроектПриказаВноситДолжность = ПолучитьШаблонДолжностиНаСервере(Объект.ПроектПриказаВносит);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано1ПриИзменении(Элемент)
	
	Объект.Согласовано1Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано1);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано2ПриИзменении(Элемент)
	
	Объект.Согласовано2Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано2);
	
КонецПроцедуры
