
#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПрограммаПриИзменении(Элемент)

	ДанныеДляЗаполнения = ПолучитьДанныеРуководителяНаСервере(Объект.Программа);

	Объект.Руководитель = ДанныеДляЗаполнения.Руководитель;
	Объект.ДолжностьРуководителя = ДанныеДляЗаполнения.Должность;
	Объект.СтепеньРуководителя = ДанныеДляЗаполнения.Степень;
	Объект.КафедраРуководителя = ДанныеДляЗаполнения.Кафедра;
	Объект.РазмерОкладаРуководителя = ДанныеДляЗаполнения.РазмерОклада;
	Объект.ОбъемПрограммы = ДанныеДляЗаполнения.КоличествоУчебныхЧасов;
	Объект.КоличествоСтудентов = ДанныеДляЗаполнения.КоличествоСлушателей;

	НормаЧасовРуководителя = ПолучитьНормуЧасовНаСервере(ДанныеДляЗаполнения.Должность);
	КоэффициентРасчета = 10;
	ПроцентОплаты = 100;
	ПроцентПремии = 0.2;
	МаксимальнаяВыплатаРуководителю = 30000;

	Объект.НормаЧасовРуководителя = НормаЧасовРуководителя;
	Объект.ТарифРуководителя = (ДанныеДляЗаполнения.РазмерОклада / НормаЧасовРуководителя) * КоэффициентРасчета;
	КВыплате = (Объект.ТарифРуководителя * Объект.КоличествоСтудентов * Объект.ОбъемПрограммы)
		/ ПроцентОплаты * ПроцентПремии;
	Объект.КВыплатеРуководителю = ?(КВыплате > МаксимальнаяВыплатаРуководителю, МаксимальнаяВыплатаРуководителю, КВыплате);

КонецПроцедуры

&НаКлиенте
Процедура РасчетПоТехническомуСопровождениюФИОПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.РасчетПоТехническомуСопровождению.ТекущиеДанные;

	ДанныеДляЗаполнения = ПолучитьДанныеНаСервере(ТекущаяСтрока.ФИО);

	ТекущаяСтрока.Должность = ДанныеДляЗаполнения.Должность;
	ТекущаяСтрока.Кафедра_Отдел = ДанныеДляЗаполнения.Кафедра;
	ТекущаяСтрока.РазмерОклада = ДанныеДляЗаполнения.РазмерОклада;
	ТекущаяСтрока.К4 = ДанныеДляЗаполнения.К4;

	ТекущаяСтрока.НормаЧасов = ПолучитьНормуЧасовНаСервере(ДанныеДляЗаполнения.Должность);

	РассчитатьКВыплатеТехПоддержка(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетПоТехническомуСопровождениюНормаЧасовПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.РасчетПоТехническомуСопровождению.ТекущиеДанные;

	РассчитатьКВыплатеТехПоддержка(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетПоТехническомуСопровождениюКоличествоЧасовПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.РасчетПоТехническомуСопровождению.ТекущиеДанные;

	РассчитатьКВыплатеТехПоддержка(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетПоТехническомуСопровождениюМесяцПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасчетПоТехническомуСопровождению.ТекущиеДанные;
	Преподаватель = ТекущаяСтрока.ФИО;
	Месяц = ТекущаяСтрока.Месяц;

	Если Преподаватель = Неопределено ИЛИ Месяц = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЧасыНаНачалоМесяца = ПолучитьЧасыПоСрезуМесяца(Преподаватель, Месяц);
	ТекущаяСтрока.КоличествоЧасов = ЧасыНаНачалоМесяца;
	
	РассчитатьКВыплатеТехПоддержка(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетФИОПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расчет.ТекущиеДанные;

	ДанныеДляЗаполнения = ПолучитьДанныеНаСервере(ТекущаяСтрока.ФИО);

	ТекущаяСтрока.Должность = ДанныеДляЗаполнения.Должность;
	ТекущаяСтрока.Степень = ДанныеДляЗаполнения.Степень;
	ТекущаяСтрока.Кафедра = ДанныеДляЗаполнения.Кафедра;
	ТекущаяСтрока.РазмерОклада = ДанныеДляЗаполнения.РазмерОклада;
	ТекущаяСтрока.К1 = ДанныеДляЗаполнения.К1;
	ТекущаяСтрока.К2 = ДанныеДляЗаполнения.К2;
	ТекущаяСтрока.К3 = ДанныеДляЗаполнения.К3;

	ТекущаяСтрока.НормаЧасов = ПолучитьНормуЧасовНаСервере(ДанныеДляЗаполнения.Должность);

	РассчитатьСтоимостьЧаса(ТекущаяСтрока);
	РассчитатьКВыплатеПреподаватели(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетНормаЧасовПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расчет.ТекущиеДанные;

	РассчитатьСтоимостьЧаса(ТекущаяСтрока);
	РассчитатьКВыплатеПреподаватели(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетКоличествоЧасовПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расчет.ТекущиеДанные;
	
	РассчитатьКВыплатеПреподаватели(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура РасчетМесяцПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расчет.ТекущиеДанные;
	Преподаватель = ТекущаяСтрока.ФИО;
	Месяц = ТекущаяСтрока.Месяц;

	Если Преподаватель = Неопределено ИЛИ Месяц = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЧасыНаНачалоМесяца = ПолучитьЧасыПоСрезуМесяца(Преподаватель, Месяц);
	ТекущаяСтрока.КоличествоЧасов = ЧасыНаНачалоМесяца;
	
	РассчитатьКВыплатеПреподаватели(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано1ПриИзменении(Элемент)
	
	Объект.Согласовано1Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано1);

КонецПроцедуры

&НаКлиенте
Процедура Согласовано2ПриИзменении(Элемент)
	
	Объект.Согласовано2Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано2);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСтоимостьЧаса(ТекущаяСтрока)

	Если ТекущаяСтрока.НормаЧасов = 0 Тогда
		Возврат;
	КонецЕсли;

	КоэффициентРасчета = 10;
	МаксимальнаяСтоимостьЧаса = 1500;

	СтоимостьЧаса = (ТекущаяСтрока.РазмерОклада * (ТекущаяСтрока.К1 + ТекущаяСтрока.К2 + ТекущаяСтрока.К3))
		/ ТекущаяСтрока.НормаЧасов
		* КоэффициентРасчета;
	ТекущаяСтрока.Тариф = СтоимостьЧаса;	
	ТекущаяСтрока.СтоимостьЧаса = ?(СтоимостьЧаса > МаксимальнаяСтоимостьЧаса, МаксимальнаяСтоимостьЧаса, СтоимостьЧаса);

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКВыплатеТехПоддержка(ТекущаяСтрока)

	Если ТекущаяСтрока.НормаЧасов = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.КВыплате = ТекущаяСтрока.РазмерОклада
		/ ТекущаяСтрока.НормаЧасов
		* ТекущаяСтрока.К4
		* ТекущаяСтрока.КоличествоЧасов;

КонецПроцедуры
	
&НаКлиенте
Процедура РассчитатьКВыплатеПреподаватели(ТекущаяСтрока)

	Если ТекущаяСтрока.НормаЧасов = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.КВыплате = ТекущаяСтрока.СтоимостьЧаса * ТекущаяСтрока.КоличествоЧасов;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере(Знач ФИО)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ФИО);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Должность КАК Должность,
	               |	Сотрудники.Подразделение КАК Кафедра,
	               |	Сотрудники.Степень КАК Степень,
	               |	ЕСТЬNULL(ДолжностныеОклады.РазмерОклада, 0) КАК РазмерОклада,
	               |	Сотрудники.К1 КАК К1,
	               |	Сотрудники.К2 КАК К2,
	               |	Сотрудники.К3 КАК К3,
	               |	Сотрудники.К4 КАК К4
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеОклады КАК ДолжностныеОклады
	               |		ПО Сотрудники.Должность = ДолжностныеОклады.Должность
	               |			И Сотрудники.Степень = ДолжностныеОклады.УченаяСтепень
	               |ГДЕ
	               |	Сотрудники.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Должность", Выборка.Должность);
		ДанныеДляЗаполнения.Вставить("Кафедра", Выборка.Кафедра);
		ДанныеДляЗаполнения.Вставить("Степень", Выборка.Степень);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", Выборка.РазмерОклада);
		ДанныеДляЗаполнения.Вставить("К1", Выборка.К1);
		ДанныеДляЗаполнения.Вставить("К2", Выборка.К2);
		ДанныеДляЗаполнения.Вставить("К3", Выборка.К3);
		ДанныеДляЗаполнения.Вставить("К4", Выборка.К4);
	Иначе
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Должность", Неопределено);
		ДанныеДляЗаполнения.Вставить("Кафедра", Неопределено);
		ДанныеДляЗаполнения.Вставить("Степень", Неопределено);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", 0);
		ДанныеДляЗаполнения.Вставить("К1", 0);
		ДанныеДляЗаполнения.Вставить("К2", 0);
		ДанныеДляЗаполнения.Вставить("К3", 0);
		ДанныеДляЗаполнения.Вставить("К4", 0);
	КонецЕсли;

	Возврат ДанныеДляЗаполнения;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЧасыПоСрезуМесяца(Знач Преподаватель, Знач Месяц)

	Год = 2026;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НагрузкаПреподавателейОбороты.ЧасыОборот КАК Часы
	|ИЗ
	|	РегистрНакопления.НагрузкаПреподавателей.Обороты(&НачалоПериода, &КонецПериода, Месяц, Преподаватель = &Преподаватель) КАК НагрузкаПреподавателейОбороты";

	Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	Запрос.УстановитьПараметр("НачалоПериода", Дата(Год, ПолучитьНомерМесяца(Месяц), 1));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата(Год, ПолучитьНомерМесяца(Месяц), 1)));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Часы = 0;
	Если Выборка.Следующий() Тогда
		Часы = Выборка.Часы;
	КонецЕсли;

	Возврат Часы;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерМесяца(Знач МесяцПеречисление)

	Возврат Перечисления.МесяцыГода.Индекс(МесяцПеречисление) + 1;

КонецФункции

&НаСервере
Функция ПолучитьШаблонДолжностиНаСервере(Знач Согласовано)

	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("Ссылка", Согласовано);

	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ДолжностьШаблон КАК ДолжностьШаблон
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДолжностьШаблон;
    КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНормуЧасовНаСервере(Знач Должность)

	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("Должность", Должность);

	Запрос.Текст = "ВЫБРАТЬ
	|	НормыЧасов.Норма КАК Норма
	|ИЗ
	|	РегистрСведений.НормыЧасов КАК НормыЧасов
	|ГДЕ
	|	НормыЧасов.Должность = &Должность";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Норма = 0;
	Если Выборка.Следующий() Тогда
		Норма = Выборка.Норма;
	КонецЕсли;

	Возврат Норма;

КонецФункции

&НаСервере
Функция ПолучитьДанныеРуководителяНаСервере(Знач Ссылка)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	УчебныеПрограммы.РуководительПрограммы КАК РуководительПрограммы,
	               |	Сотрудники.Должность КАК Должность,
	               |	Сотрудники.Степень КАК Степень,
	               |	Сотрудники.Подразделение КАК Подразделение,
	               |	ДолжностныеОклады.РазмерОклада КАК РазмерОклада,
	               |	УчебныеПрограммы.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
	               |	УчебныеПрограммы.КоличествоСлушателей КАК КоличествоСлушателей
	               |ИЗ
	               |	Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеОклады КАК ДолжностныеОклады
	               |			ПО Сотрудники.Должность = ДолжностныеОклады.Должность
	               |				И Сотрудники.Степень = ДолжностныеОклады.УченаяСтепень
	               |		ПО УчебныеПрограммы.РуководительПрограммы = Сотрудники.Ссылка
	               |ГДЕ
	               |	УчебныеПрограммы.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Выборка.РуководительПрограммы);
		ДанныеДляЗаполнения.Вставить("Должность", Выборка.Должность);
		ДанныеДляЗаполнения.Вставить("Степень", Выборка.Степень);
		ДанныеДляЗаполнения.Вставить("Кафедра", Выборка.Подразделение);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", Выборка.РазмерОклада);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", Выборка.КоличествоУчебныхЧасов);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", Выборка.КоличествоСлушателей);
	Иначе
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Неопределено);
		ДанныеДляЗаполнения.Вставить("Должность", Неопределено);
		ДанныеДляЗаполнения.Вставить("Степень", Неопределено);
		ДанныеДляЗаполнения.Вставить("Кафедра", Неопределено);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", 0);
	КонецЕсли;

	Возврат ДанныеДляЗаполнения;

КонецФункции

#КонецОбласти

