
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьШаблон(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Шаблон Word (*.dotx)|*.dotx";
	ДиалогВыбора.Заголовок = "Выберите файл шаблона";

	Если ДиалогВыбора.Выбрать() Тогда
		ЗагрузитьШаблонНаСервере(ДиалогВыбора.ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьШаблон(Команда)

	Если НЕ ШаблонЗагруженНаСервере() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Шаблон не загружен";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;

	ПросмотретьШаблонНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьШаблонНаСервере(Знач ПолноеИмяФайла)

	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	Объект.Шаблон = Новый ХранилищеЗначения(ДвоичныеДанные);
	ПозицияРазделителя = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
	Объект.ИмяФайла = Сред(ПолноеИмяФайла, ПозицияРазделителя + 1);
	Объект.РазмерФайла = ДвоичныеДанные.Размер();

КонецПроцедуры

&НаСервере
Процедура ПросмотретьШаблонНаСервере()

	ДвоичныеДанные = Объект.Шаблон.Получить();
	ВременныйФайл = ПолучитьИмяВременногоФайла(".dotx");
	
	Попытка
		ДвоичныеДанные.Записать(ВременныйФайл);
		
	Исключение   
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Файл был поврежден или удален. Для продолжения работы загрузите заново.";
		СообщениеПользователю.Сообщить();
		Возврат;		
	КонецПопытки;

	ЗапуститьПриложение(ВременныйФайл);

КонецПроцедуры

&НаСервере
Функция ШаблонЗагруженНаСервере()

	Возврат Объект.Шаблон <> Неопределено;

КонецФункции

#КонецОбласти
