#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТипДокумента = ПолучитьТипДокументаНаСервере();

	Оповещение = Новый ОписаниеОповещения(
		"ВыборШаблонаЗавершен",
		ЭтотОбъект,
		Новый Структура("ПараметрКоманды", ПараметрКоманды));

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("ТипДокумента", ТипДокумента);	

	ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаВыбора", ПараметрыОткрытия, , , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборШаблонаЗавершен(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора <> Неопределено Тогда
		СсылкаНаШаблон = РезультатВыбора;
		
		Если Не СсылкаНаШаблон.Пустая() Тогда
			ПараметрыДокумента = ПолучитьПараметрыНаСервере(ДополнительныеПараметры.ПараметрКоманды[0]);
			ФайлWord = ДокументWordНаОсновеШаблона(СсылкаНаШаблон, ПараметрыДокумента);
			
			Если ФайлWord <> Неопределено Тогда
				ЗапуститьПриложение(ФайлWord);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТипДокументаНаСервере()

	Возврат Перечисления.ТипыДокументов.ДелениеНаПодгруппы;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыНаСервере(Знач Ссылка)

	ПараметрыДокумента = Новый Структура();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчебныеПрограммы.НаименованиеПрограммы КАК НаименованиеПрограммы,
	|	УчебныеПрограммы.НомерГруппы КАК НомерГруппы
	|ИЗ
	|	Документ.ФормированиеПодгруппы КАК ФормированиеПодгруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ПО ФормированиеПодгруппы.Программа = УчебныеПрограммы.Ссылка
	|ГДЕ
	|	ФормированиеПодгруппы.Ссылка = &Ссылка";   

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл		
		ПараметрыДокумента.Вставить("НаименованиеПрограммы",Выборка.НаименованиеПрограммы);
		ПараметрыДокумента.Вставить("НомерГруппы", Выборка.НомерГруппы); 
		ПараметрыДокумента.Вставить(
			"ИмяФайла",
			"Распоряжение на разделение на подгруппы " + СтрЗаменить(Выборка.НомерГруппы, "/", "-"));
	КонецЦикла;  

	СоставПодгрупп = Новый Массив();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчебныеПрограммы.Ссылка КАК Ссылка,
	|	УчебныеПрограммы.НомерГруппы КАК НомерГруппы,
	|	УчебныеПрограммы.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_Программа
	|ИЗ
	|	Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеПодгруппы КАК ФормированиеПодгруппы
	|		ПО УчебныеПрограммы.Ссылка = ФормированиеПодгруппы.Программа
	|ГДЕ
	|	ФормированиеПодгруппы.Ссылка = &Ссылка
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СТРОКА(ВТ_Программа.НомерГруппы + ""/"" + ФормированиеПодгруппы.НомерПодгруппы) КАК НомерПодгруппы,
	|	Студенты.Наименование КАК ФИО,
	|	ВТ_Программа.НомерГруппы КАК НомерГруппы,
	|	ВТ_Программа.Наименование КАК НаименованиеПрограммы
	|ИЗ
	|	Документ.ФормированиеПодгруппы.СписокСлушателей КАК СозданиеПодгруппыСписокСлушателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеПодгруппы КАК ФормированиеПодгруппы
	|		ПО СозданиеПодгруппыСписокСлушателей.Ссылка = ФормированиеПодгруппы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Студенты КАК Студенты
	|		ПО СозданиеПодгруппыСписокСлушателей.Слушатель = Студенты.Ссылка,
	|		ВТ_Программа КАК ВТ_Программа
	|ГДЕ
	|	ФормированиеПодгруппы.Программа = ВТ_Программа.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПодгруппы";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ИндексПодгруппы = Неопределено;
		
		Для Инд = 0 По СоставПодгрупп.Количество() - 1 Цикл
			Если СоставПодгрупп[Инд].Номер = Выборка.НомерПодгруппы Тогда
				ИндексПодгруппы = Инд;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ИндексПодгруппы = Неопределено Тогда
			СтруктураПодгруппы = Новый Структура("Номер, Студенты", Выборка.НомерПодгруппы, Новый Массив());
			СоставПодгрупп.Добавить(СтруктураПодгруппы);
			ИндексПодгруппы = СоставПодгрупп.Количество() - 1;
		КонецЕсли;
		
		СоставПодгрупп[ИндексПодгруппы].Студенты.Добавить(СокрЛП(Выборка.ФИО));
	КонецЦикла;	

	СтрокаСписокПодгрупп = "";

	Для Каждого Подгруппа Из СоставПодгрупп Цикл
		
		Если СтрокаСписокПодгрупп = "" Тогда
			СтрокаСписокПодгрупп = Подгруппа.Номер;
			Продолжить;
		КонецЕсли;
		
		СтрокаСписокПодгрупп = СтрокаСписокПодгрупп + ", " + Подгруппа.Номер;
	КонецЦикла;

	ПараметрыДокумента.Вставить("СписокПодгрупп", СтрокаСписокПодгрупп);
	ПараметрыДокумента.Вставить("ФИО", СоставПодгрупп);
	ПараметрыДокумента.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыДокументов.ДелениеНаПодгруппы"));

	Возврат ПараметрыДокумента;

КонецФункции

#КонецОбласти
