#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТипДокумента") И Параметры.ТипДокумента <> Неопределено Тогда
		ОтборПоТипу = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоТипу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
		ОтборПоТипу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоТипу.Использование = Истина;
		ОтборПоТипу.ПравоеЗначение = Параметры.ТипДокумента;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти