#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("МножественныйВыбор") И Параметры.МножественныйВыбор = Истина Тогда
		
		Если (Параметры.Свойство("ТипДокумента1") И Параметры.ТипДокумента1 <> Неопределено)
			И (Параметры.Свойство("ТипДокумента2") И Параметры.ТипДокумента2 <> Неопределено)
			И (Параметры.Свойство("ТипДокумента3") И Параметры.ТипДокумента3 <> Неопределено)
			И (Параметры.Свойство("ТипДокумента4") И Параметры.ТипДокумента4 <> Неопределено) Тогда
			
			ОтборПоТипу = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ОтборПоТипу.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
			
			ЭлементОтбора = ОтборПоТипу.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Параметры.ТипДокумента1;
			
			ЭлементОтбора = ОтборПоТипу.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Параметры.ТипДокумента2;
			
			ЭлементОтбора = ОтборПоТипу.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Параметры.ТипДокумента3;
			
			ЭлементОтбора = ОтборПоТипу.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Параметры.ТипДокумента4;
		КонецЕсли;	
		
	ИначеЕсли Параметры.Свойство("ТипДокумента") И Параметры.ТипДокумента <> Неопределено Тогда
		ОтборПоТипу = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоТипу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
		ОтборПоТипу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоТипу.Использование = Истина;
		ОтборПоТипу.ПравоеЗначение = Параметры.ТипДокумента;
		
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти