
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Основная Тогда
	
		Месяц = ОпределитьМесяц(ДатаНачала);
			
		Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен преподаватель";
			СообщениеПользователю.Поле = "Преподаватель";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Месяц) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен месяц";
			СообщениеПользователю.Поле = "Месяц";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);
		ЭлементБлокировки.УстановитьЗначение("Месяц", Месяц);
		Блокировка.Заблокировать();
	
		Движения.НагрузкаПреподавателей.Записывать = Истина;
		
		Движение = Движения.НагрузкаПреподавателей.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = Преподаватель;
		Движение.Месяц = Месяц;
		Движение.Часы = 2;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьМесяц(Знач ДатаЗадачи)
	
	НомерМесяца = Месяц(ДатаЗадачи);
	
	ПеречислениеМесяцев = Перечисления.МесяцыГода;
	
	Возврат ПеречислениеМесяцев.Получить(НомерМесяца - 1);
	
КонецФункции
